<html>
	<head>
		<title></title>
	</head>
	<body>
		<p>
			&nbsp;</p>
		<h1>
			Bases de Git&nbsp;</h1>
		<p>
			<input alt="" src="http://progit.org/figures/ch1/18333fig0106-tn.png" style="width: 500px; height: 460px; " type="image" /></p>
		<p>
			&nbsp;</p>
		<p>
			Essayons de voir ce que tout se passe dans un projet. Au d&eacute;part, nous supposons que notre projet est d&eacute;j&agrave; pr&eacute;sent dans certains externes &laquo;&nbsp;d&eacute;p&ocirc;t &laquo;&nbsp;. Pour t&eacute;l&eacute;charger ce code, nous utilisons la commande suivante</p>
		<p>
			git clone &lt;URL&gt;</p>
		<p>
			par exemple:-</p>
		<ol>
			<li>
				git clone <a href="mailto:elecinf381@hg.comelec.enst.fr:2011/Pr%C3%A8nomNom">elecinf381@hg.comelec.enst.fr:2011/Pr&egrave;nomNom</a></li>
		</ol>
		<p>
			Nous avons une copie du r&eacute;f&eacute;rentiel externe dans notre syst&egrave;me local. Maintenant, si nous voulons ajouter un nouveau fichier &agrave; notre projet, nous cr&eacute;er le fichier, eg. EthernetDriver.c, mais Git ne sait rien s&ucirc;r cette fichier . Donc, l&#39;&eacute;tat actuel du fichier est &quot;Untracked&quot;.</p>
		<ol>
			<li>
				Emacs EthernetDriver.c (&Eacute;crire le code et sauvegardez le fichier)</li>
		</ol>
		<p>
			&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Le r&eacute;pertoire dans lequel nous travaillons est appel&eacute; &laquo;&nbsp;r&eacute;pertoire de travail&nbsp;&raquo; ou &laquo;&nbsp;Working Directory &laquo;. Nous faisons codage dans ce r&eacute;pertoire.</p>
		<p>
			Pour obtenir le statut d&#39;aucun fichier, nous faisons <strong>git status</strong> &lt;filename&gt; ou juste git status</p>
		<ol>
			<li>
				git status Etherenet.c</li>
		</ol>
		<p>
			# On branch master</p>
		<p>
			# Untracked files:</p>
		<p>
			#&nbsp;&nbsp; (use &quot;git add &lt;file&gt;...&quot; to include in what will be committed)</p>
		<p>
			#</p>
		<p>
			#&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; EthernetDriver.c</p>
		<p>
			nothing added to commit but untracked files present (use &quot;git add&quot; to track)</p>
		<p>
			Si nous faisons git status sur EthernetDriver.c apr&egrave;s sa cr&eacute;ation nous voir que Git rapports &agrave; nous qu&#39;il est &laquo;&nbsp;Untracked &laquo;&nbsp;.</p>
		<p>
			D&#39;ajouter ce fichier dans d&eacute;p&ocirc;t local, nous utilisons la commande &nbsp;<strong>git add </strong>&lt;filename&gt;</p>
		<ol>
			<li>
				git add EthernetDriver.c</li>
		</ol>
		<p>
			Apr&egrave;s cela, git commencera suivi ce dossier et il change le statut du fichier de &laquo;&nbsp;Untracked&laquo; &agrave; &laquo;&nbsp;Tracked &laquo;. Un fichier qui peut-&ecirc;tre d&eacute;j&agrave; suivis par git a le statut &quot;Intact&quot; sauf si vous faites certains changements. Le statut du fichier devient alors &#39;&#39;modification&quot;.</p>
		<p>
			Apr&egrave;s avoir fait les changements, id&eacute;alement, nous devrions tester nos modifications et une fois nous sommes satisfaits nous puissions proc&eacute;der de stocker ces changements en permanence &agrave; notre d&eacute;p&ocirc;t local. Ceci est appel&eacute; &quot;committed&quot; un fichier. Dans Git, tous les changements qui sont d&#39;&ecirc;tre commis sont d&#39;abord stock&eacute;es dans une zone appel&eacute;e &quot;Staging Area&quot;. Pour ce faire, nous allons utiliser la commande encore git add.</p>
		<p>
			git add &lt;filename&gt;</p>
		<ol>
			<li>
				git add EthernetDriver.c</li>
		</ol>
		<p>
			Cette commande va prendre les changements pr&eacute;sents dans le dossier et va stocker dans le &quot;staging area&quot;. L&#39;&eacute;tat du fichier est maintenant &laquo;&nbsp;<strong>staged</strong> &laquo;&nbsp;. Si nous modifier le fichier apr&egrave;s cela, le changement ne serait pas refl&eacute;t&eacute; dans &laquo;staged area&nbsp;&laquo;&nbsp; et, partant ne seront pas stock&eacute;s dans notre d&eacute;p&ocirc;t sur le prochain commettre. Pour mettre &agrave; jour tout autre changement qui serait arriv&eacute; dans le fichier apr&egrave;s &laquo;staging&laquo;,nous utiliser la commande</p>
		<p>
			git add &ndash;u</p>
		<p>
			Pour supprimer un fichier d&#39;un d&eacute;p&ocirc;t git utilisation</p>
		<p>
			<strong>git rm</strong> &lt;filename&gt;</p>
		<p>
			Et &agrave; supprimer tout fichier de la zone &laquo;staging area&laquo;&nbsp;, l&#39;utiliser avec l&#39;option</p>
		<p>
			&nbsp;git rm --cached &lt;filename&gt;</p>
		<p>
			De commettre un fichier nous utilisons</p>
		<ol>
			<li>
				<strong>git commit </strong></li>
		</ol>
		<p>
			Seuls les changements pr&eacute;sents dans la zone &laquo;&nbsp;staging area&nbsp;&raquo; obtiendrez commis. Si nous ajoutons le nom de fichier comme</p>
		<p>
			Git commit &lt;Filename&gt;</p>
		<p>
			Alors, nous n&rsquo;avons pas besoin de &quot;stage&quot; le fichier.</p>
		<p>
			En utilisant l&#39;option -a avec les commettre commande automatiquement &quot;ajouter&quot; changements des fichiers (&agrave; savoir tous les fichiers qui sont d&eacute;j&agrave; &eacute;num&eacute;r&eacute;s) et &agrave; automatiquement &quot;rm&quot; des fichiers dans l&#39;index qui ont &eacute;t&eacute; retir&eacute;s du travail arbre, et ensuite d&#39;ex&eacute;cuter la commettre.</p>
		<p>
			&nbsp;</p>
		<p>
			<input alt="Source: ProGit " src="http://progit.org/figures/ch2/18333fig0201-tn.png" style="width: 500px; height: 317px; " type="image" /></p>
		<p>
			&nbsp;</p>
		<p>
			Voir l&#39;ensemble l&#39;histoire &laquo;commit&laquo;&nbsp;d&#39;un fichier nous pouvons utiliser</p>
		<p>
			git log &lt;filename&gt;</p>
		<p>
			git log EthernetDriver.c</p>
		<p>
			Utilisez &ndash;p avec la commande ci-dessus pour afficher le patch aussi</p>
		<p>
			Afin d&#39;afficher les diff&eacute;rences entre les diff&eacute;rentes versions d&#39;un fichier nous utilisons la commande</p>
		<p>
			git diff &lt;filename&gt;</p>
		<p>
			Cette affiche les diff&eacute;rences en ce qui concerne r&eacute;pertoire de travail. De voir les changements pr&eacute;sents dans la zone &laquo;staging area&nbsp;&laquo;&nbsp; utiliser l&#39;option &ndash;cached avec la commande ci-dessus.</p>
		<p>
			Sources&nbsp;:- ProGit et Git Man Pages</p>
	</body>
</html>

